 /*
 * Напиши скрит підрахунку вартості покупки зі знижкою в залежності від потраченої суми за весь час (партнерська програма).
 *
 * - Загальна сума випотраченого зберігається в змінній totalSpent
 * - Сума поточного платежу зберігається в змінній payment
 * - Скидка зберігається в змінній discount
 *
 * - Якщо витрачено від [100 до 1000) - бронзовий партнер, скидка 2%
 * - Якщо витрачено від [1000 до 5000) - срібний партнер, скидка 5%
 * * - Якщо витрачено більше [5000 - золотий партнер, скидка 10%
 * - Якщо витрачено менше 100) - не партнер, скидка 0%
 *
 * - В результаті вивести повідомлення
 * «Оформляємо замовлення на суму [сума] зі знижкою [знижка]%»
 */
// 'бронзовий партнер, скидка 2%'
// 'срібний партнер, скидка 5%'
// 'золотий партнер, скидка 10%'
// 'У вас ще немає партнерської знижки'



// const totalSpent = 4000;
// let payment = 500;
// let discount = 0;
// let message = "";

//1. Визначаемо розмір скидки

// if (100 < totalSpent && totalSpent < 1000) {
//  discount = 2;
//   message = `Вітаемо, Ви стали бронзовим партнером, Ваша скидка ${discount}%`;
// } else if (1000 < totalSpent && totalSpent < 5000) {
//  discount = 5;
//   message = `Вітаемо, Ви стали срібним партнером, Ваша скидка ${discount}%`;
// } else if (5000 < totalSpent) {
//   discount = 10;
//    message = `Вітаемо, Ви стали золотим партнером, Ваша скидка  ${discount}%`;
// } else {
//   message = 'Вітаемо, Ви не партнер!';
// };
// console.log(message);

// // 2. Повідомляемо кліента про вартість покупки і скидку

// payment = payment - (payment / 100 * discount);
// const messagePayment =  `Оформляємо замовлення на суму ${payment} зі знижкою ${discount}%`;
// console.log(messagePayment);


let balance = 10000;
const payment = 2000
message = balsnce > 0 ? "" : "";
console.log(message)